from pytest import fixture


@fixture
def f_lyrics():
    lyrics = '''
    넌 아직 모르고 있니 흔들리는 마음을
    너에겐 좀 어색하지만
    내겐 익숙해진 이야긴걸

    널 스쳐가는 눈빛 속에
    혹시 마주칠까 두려워 망설이는 너
    네게 미소 짓는 모습 보며
    혹시 나일까 아닐까 고민하겠지

    널 유혹하고 있는 것도 아닌데
    나 손짓하고 있는 것도 아닐텐데
    흔들리는 네 모습이 우습겠지만

    날 벗어나려 자꾸 애를 써봐도
    눈 감고 나를 보지 않으려 해도 넌
    내 안으로 빠져들어 유감일 뿐야

    넌 아직 모른척하며 외면하려 하지만
    한 걸음 자꾸 다가서는 날
    피하려고 하지도 않는걸

    널 스쳐가는 눈빛 속에
    혹시 마주칠까 두려워 망설이는 너
    또 네게 미소 짓는 모습보며
    혹시 나일까 아닐까 고민하겠지

    널 유혹하고 있는 것도 아닌데
    나 손짓하고 있는 것도 아닐텐데
    흔들리는 네 모습이 우습겠지만

    날 벗어나려 자꾸 애를 써봐도
    눈 감고 나를 보지 않으려 해도
    넌 내 안으로 빠져들어 유감일 뿐야

    1  2

    유혹하고 있는 것도 아닌데
    손짓하고 있는 것도 아닐텐데

    벗어나려고 해봐도
    눈 감으려고 해봐도 나
    나에게 빠져들어 유감일뿐야
    '''
    return lyrics
